'''
Метод .filter() внутри выражения позволяет делать вычисления только по тем строкам, которые соответствуют условию,
но без удаления остальных строк из итогового датафрейма.

Задача:
Есть данные по продажам менеджеров в разных регионах.
Требуется
 Посчитать для каждой строки средний чек в этом регионе, но только среди продаж,
 совершенных в рамках «Крупных сделок» (когда сумма сделки > 500).
 При этом мелкие сделки тоже должны остаться в таблице, и для них тоже должна показаться эта средняя величина региона.
'''
import polars as pl

df = pl.DataFrame({
    "region": ["West", "West", "West", "East", "East", "East"],
    "manager": ["Иван", "Мария", "Петр", "Анна", "Елена", "Сергей"],
    "amount": [100, 800, 600, 200, 150, 900]
})

result = df.with_columns(
    pl.col("amount")
    # 1. Фильтруем данные прямо внутри выражения
    .filter(pl.col("amount") > 500)
    # 2. Считаем среднее только по отфильтрованным строкам
    .mean()
    # 3. Применяем окно по регионам
    .over("region")
    # 4. Называем новую колонку
    .alias("mean_major_deals_in_region")
)

print(result)
